Update to emphasis on scale up of resoures
