--- a/keps/sig-node/3953-dynamic-node-resize/README.md
+++ b/keps/sig-node/3953-dynamic-node-resize/README.md
@@ -145,66 +144,42 @@ Consider including folks who also work outside the SIG or subproject.
+
 Below diagram is shows the interaction between kubelet and cAdvisor.
 
-```
-+----------+                    +-----------+                   +-----------+                  +--------------+
-|          |                    |           |                   |           |                  |              |
-|   node   |                    |  kubelet  |                   |  cAdvisor |                  | machine-info |
-|          |                    |           |                   |   cache   |                  |              |
-+----+-----+                    +-----+-----+                   +-----+-----+                  +-------+------+
-     |                                |                               |                                |
-     |                                |            poll               |                                |
-     |                                |------------------------------>|                                |
-     |                                |                               |                                |
-     |                                |                               |                                |
-     |                                |                               |             fetch              |
-     |                                |                               |------------------------------->|
-     |                                |                               |                                |
-     |                                |                               |                                |
-     |                                |                               |                                |
-     |                                |                               |             update             |
-     |                                |                               |<-------------------------------|
-     |                                |                               |                                |
-     |                                |            update             |                                |
-     |                                |<------------------------------|                                |
-     |                                |                               |                                |
-     |                                |                               |                                |
-     |                                |                               |                                |
-     |     node status update         |                               |                                |
-     |<-------------------------------|                               |                                |
-     |                                |                               |                                |
-     |      if shrink in resource     |                               |                                |
-     |      re-run pod admission      |                               |                                |
-     |<-------------------------------|                               |                                |                                |
-     |                                |                               |                                |      
-     | re-initialize resource managers|                               |                                |
-     |<-------------------------------|                               |                                |                                |
-     |                                |                               |                                |           
 
+```mermaid
+sequenceDiagram
+    participant node
+    participant kubelet
+    participant cAdvisor-cache
+    participant machine-info
+    kubelet->>cAdvisor-cache: Poll
+    cAdvisor-cache->>machine-info: fetch
+    machine-info->>cAdvisor-cache: update
+    cAdvisor-cache->>kubelet: update
+    kubelet->>node: node status update
+    kubelet->>node: re-initialize resource managers
 ```
 
 The interaction sequence is as follows
-1. Kubelet will be polling in interval of configured time to fetch the machine resource information from cAdvisor's cache, Which is currently updated every 5 minutes.
